In [2]:
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++print("HelloWorld")

HelloWorld

In [3]:
import numpy as np
import pandas as pd

In [4]:
student_data = {
    '학번': [1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010],
    '이름': ['김철수', '이영희', '박민수', '정지영', '최현우', '강수진', '윤준호', '송미라', '황태영', '조은지'],
    '성별': ['남', '여', '남', '여', '남', '여', '남', '여', '남', '여'],
    '나이': [21, 23, 22, 24, 20, 23, 22, 21, 24, np.nan],  # 결측치 포함
    '학과': ['컴퓨터공학', '경영학', '물리학', '화학', '수학', '영문학', '컴퓨터공학', '통계학', '경영학', '화학'],
    '학년': [1, 3, 2, 4, 1, 3, 2, 1, 4, 3],
    '평점': [3.5, 4.2, 3.1, 4.5, 3.8, 4.0, 3.2, 3.9, 4.1, 3.7],
    '장학금': [False, True, False, True, False, True, False, True, False, True],
    '입학일': ['2021-03-02', '2019-03-04', '2020-03-02', '2018-03-05', '2021-03-02',
              '2019-03-04', '2020-03-02', '2021-03-02', '2018-03-05', '2019-03-04']
}

In [7]:
df = pd.DataFrame(student_data)

In [8]:
df.head()

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02
1  1002  이영희  여  23.0    경영학   3  4.2   True  2019-03-04
2  1003  박민수  남  22.0    물리학   2  3.1  False  2020-03-02
3  1004  정지영  여  24.0     화학   4  4.5   True  2018-03-05
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02

In [9]:
df.tail()

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
5  1006  강수진  여  23.0    영문학   3  4.0   True  2019-03-04
6  1007  윤준호  남  22.0  컴퓨터공학   2  3.2  False  2020-03-02
7  1008  송미라  여  21.0    통계학   1  3.9   True  2021-03-02
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05
9  1010  조은지  여   NaN     화학   3  3.7   True  2019-03-04

In [11]:
df.shape

(10, 9)

In [12]:
df.columns.tolist()

['학번', '이름', '성별', '나이', '학과', '학년', '평점', '장학금', '입학일']

In [13]:
df.index.tolist()

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학번      10 non-null     int64
 1   이름      10 non-null     object
 2   성별      10 non-null     object
 3   나이      9 non-null      float64
 4   학과      10 non-null     object
 5   학년      10 non-null     int64
 6   평점      10 non-null     float64
 7   장학금     10 non-null     bool
 8   입학일     10 non-null     object
dtypes: bool(1), float64(2), int64(2), object(4)
memory usage: 782.0+ bytes

In [15]:
df.describe()

               학번         나이         학년         평점
count    10.00000   9.000000  10.000000  10.000000
mean   1005.50000  22.222222   2.400000   3.800000
std       3.02765   1.394433   1.173788   0.439697
min    1001.00000  20.000000   1.000000   3.100000
25%    1003.25000  21.000000   1.250000   3.550000
50%    1005.50000  22.000000   2.500000   3.850000
75%    1007.75000  23.000000   3.000000   4.075000
max    1010.00000  24.000000   4.000000   4.500000

In [16]:
name_series = df['이름']

In [17]:
name_series.head()

0    김철수
1    이영희
2    박민수
3    정지영
4    최현우
Name: 이름, dtype: object

In [18]:
subset = df[['이름','평점']]

In [19]:
subset.head()

    이름   평점
0  김철수  3.5
1  이영희  4.2
2  박민수  3.1
3  정지영  4.5
4  최현우  3.8

In [20]:
first_row = df.iloc[0]

In [21]:
first_row

학번           1001
이름            김철수
성별              남
나이           21.0
학과          컴퓨터공학
학년              1
평점            3.5
장학금         False
입학일    2021-03-02
Name: 0, dtype: object

In [22]:
specific_rows = df.iloc[1:3]

In [23]:
specific_rows

     학번   이름 성별    나이   학과  학년   평점    장학금         입학일
1  1002  이영희  여  23.0  경영학   3  4.2   True  2019-03-04
2  1003  박민수  남  22.0  물리학   2  3.1  False  2020-03-02

In [24]:
df[df['성별'] == '남']

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02
2  1003  박민수  남  22.0    물리학   2  3.1  False  2020-03-02
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02
6  1007  윤준호  남  22.0  컴퓨터공학   2  3.2  False  2020-03-02
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05

In [25]:
df[(df['성별'] == '남') & (df['평점'] >= 3.5)]

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05

In [26]:
df[(df['나이'] < 22) | (df['평점'] > 4.0)]

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02
1  1002  이영희  여  23.0    경영학   3  4.2   True  2019-03-04
3  1004  정지영  여  24.0     화학   4  4.5   True  2018-03-05
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02
7  1008  송미라  여  21.0    통계학   1  3.9   True  2021-03-02
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05

In [27]:
df.sort_values('나이')

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02
7  1008  송미라  여  21.0    통계학   1  3.9   True  2021-03-02
2  1003  박민수  남  22.0    물리학   2  3.1  False  2020-03-02
6  1007  윤준호  남  22.0  컴퓨터공학   2  3.2  False  2020-03-02
1  1002  이영희  여  23.0    경영학   3  4.2   True  2019-03-04
5  1006  강수진  여  23.0    영문학   3  4.0   True  2019-03-04
3  1004  정지영  여  24.0     화학   4  4.5   True  2018-03-05
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05
9  1010  조은지  여   NaN     화학   3  3.7   True  2019-03-04

In [29]:
df.sort_values('평점', ascending = False)

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
3  1004  정지영  여  24.0     화학   4  4.5   True  2018-03-05
1  1002  이영희  여  23.0    경영학   3  4.2   True  2019-03-04
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05
5  1006  강수진  여  23.0    영문학   3  4.0   True  2019-03-04
7  1008  송미라  여  21.0    통계학   1  3.9   True  2021-03-02
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02
9  1010  조은지  여   NaN     화학   3  3.7   True  2019-03-04
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02
6  1007  윤준호  남  22.0  컴퓨터공학   2  3.2  False  2020-03-02
2  1003  박민수  남  22.0    물리학   2  3.1  False  2020-03-02

In [30]:
df.sort_values(['성별', '평점'], ascending=[True, False])

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02
6  1007  윤준호  남  22.0  컴퓨터공학   2  3.2  False  2020-03-02
2  1003  박민수  남  22.0    물리학   2  3.1  False  2020-03-02
3  1004  정지영  여  24.0     화학   4  4.5   True  2018-03-05
1  1002  이영희  여  23.0    경영학   3  4.2   True  2019-03-04
5  1006  강수진  여  23.0    영문학   3  4.0   True  2019-03-04
7  1008  송미라  여  21.0    통계학   1  3.9   True  2021-03-02
9  1010  조은지  여   NaN     화학   3  3.7   True  2019-03-04

In [31]:
gender_group = df.groupby('성별')

In [32]:
gender_group

In [33]:
gender_group.mean(numeric_only=True)

        학번     나이   학년    평점  장학금
성별
남   1005.0  21.80  2.0  3.54  0.0
여   1006.0  22.75  2.8  4.06  1.0

In [34]:
gender_agg = gender_group.agg({
    '나이': ['mean', 'min', 'max', 'count'],
    '평점': ['mean', 'min', 'max', 'std']
})

In [35]:
gender_agg

       나이                      평점
     mean   min   max count  mean  min  max       std
성별
남   21.80  20.0  24.0     5  3.54  3.1  4.1  0.415933
여   22.75  21.0  24.0     4  4.06  3.7  4.5  0.304959

In [36]:
df['나이_25초과'] = df['나이'] > 25

In [37]:
multi_group = df.groupby(['성별', '나이_25초과'])

In [38]:
multi_group.mean(numeric_only=True)

                학번     나이   학년    평점  장학금
성별 나이_25초과
남  False    1005.0  21.80  2.0  3.54  0.0
여  False    1006.0  22.75  2.8  4.06  1.0

In [39]:
df.isnull()

      학번     이름     성별     나이     학과     학년     평점    장학금    입학일  나이_25초과
0  False  False  False  False  False  False  False  False  False    False
1  False  False  False  False  False  False  False  False  False    False
2  False  False  False  False  False  False  False  False  False    False
3  False  False  False  False  False  False  False  False  False    False
4  False  False  False  False  False  False  False  False  False    False
5  False  False  False  False  False  False  False  False  False    False
6  False  False  False  False  False  False  False  False  False    False
7  False  False  False  False  False  False  False  False  False    False
8  False  False  False  False  False  False  False  False  False    False
9  False  False  False   True  False  False  False  False  False    False

In [40]:
df.isnull().sum()

학번         0
이름         0
성별         0
나이         1
학과         0
학년         0
평점         0
장학금        0
입학일        0
나이_25초과    0
dtype: int64

In [41]:
df[df.isnull().any(axis=1)]

     학번   이름 성별  나이  학과  학년   평점   장학금         입학일  나이_25초과
9  1010  조은지  여 NaN  화학   3  3.7  True  2019-03-04    False

In [42]:
df_dropna = df.dropna()

In [43]:
df_dropna

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일  나이_25초과
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02    False
1  1002  이영희  여  23.0    경영학   3  4.2   True  2019-03-04    False
2  1003  박민수  남  22.0    물리학   2  3.1  False  2020-03-02    False
3  1004  정지영  여  24.0     화학   4  4.5   True  2018-03-05    False
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02    False
5  1006  강수진  여  23.0    영문학   3  4.0   True  2019-03-04    False
6  1007  윤준호  남  22.0  컴퓨터공학   2  3.2  False  2020-03-02    False
7  1008  송미라  여  21.0    통계학   1  3.9   True  2021-03-02    False
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05    False

In [44]:
df_dropna.isnull().sum()

학번         0
이름         0
성별         0
나이         0
학과         0
학년         0
평점         0
장학금        0
입학일        0
나이_25초과    0
dtype: int64

In [45]:
df_dropna_subset = df.dropna(subset=['나이'])

In [46]:
df_dropna_subset

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일  나이_25초과
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02    False
1  1002  이영희  여  23.0    경영학   3  4.2   True  2019-03-04    False
2  1003  박민수  남  22.0    물리학   2  3.1  False  2020-03-02    False
3  1004  정지영  여  24.0     화학   4  4.5   True  2018-03-05    False
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02    False
5  1006  강수진  여  23.0    영문학   3  4.0   True  2019-03-04    False
6  1007  윤준호  남  22.0  컴퓨터공학   2  3.2  False  2020-03-02    False
7  1008  송미라  여  21.0    통계학   1  3.9   True  2021-03-02    False
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05    False

In [47]:
df_filled = df.copy()

In [48]:
df_filled

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일  나이_25초과
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02    False
1  1002  이영희  여  23.0    경영학   3  4.2   True  2019-03-04    False
2  1003  박민수  남  22.0    물리학   2  3.1  False  2020-03-02    False
3  1004  정지영  여  24.0     화학   4  4.5   True  2018-03-05    False
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02    False
5  1006  강수진  여  23.0    영문학   3  4.0   True  2019-03-04    False
6  1007  윤준호  남  22.0  컴퓨터공학   2  3.2  False  2020-03-02    False
7  1008  송미라  여  21.0    통계학   1  3.9   True  2021-03-02    False
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05    False
9  1010  조은지  여   NaN     화학   3  3.7   True  2019-03-04    False

In [62]:
df_filled['나이'] = df_filled['나이'].fillna(0)

In [63]:
df_filled['나이']

0    21.0
1    23.0
2    22.0
3    24.0
4    20.0
5    23.0
6    22.0
7    21.0
8    24.0
9    24.0
Name: 나이, dtype: float64

In [64]:
df_filled[df_filled['학번'] == 1010]

     학번   이름 성별    나이  학과  학년   평점   장학금         입학일  나이_25초과
9  1010  조은지  여  24.0  화학   3  3.7  True  2019-03-04    False

In [54]:
df_filled_mean = df.copy()

In [55]:
mean_age = df['나이'].mean()

In [56]:
df_filled_mean['나이'] = df_filled_mean['나이'].fillna(mean_age)

In [58]:
df_filled_mean[df_filled_mean['학번'] == 1010]

     학번   이름 성별         나이  학과  학년   평점   장학금         입학일  나이_25초과
9  1010  조은지  여  22.222222  화학   3  3.7  True  2019-03-04    False

In [65]:
Q1 = df['평점'].quantile(0.25)
Q3 = df['평점'].quantile(0.75)
IQR = Q3 - Q1

In [66]:
print(f"1사분위(Q1): {Q1}, 3사분위(Q3): {Q3}, IQR: {IQR}")

1사분위(Q1): 3.55, 3사분위(Q3): 4.074999999999999, IQR: 0.5249999999999995

In [67]:
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

In [68]:
print(f"하한값: {lower_bound}, 상한값: {upper_bound}")

하한값: 2.7625000000000006, 상한값: 4.862499999999999

In [69]:
outliers = df[(df['평점'] < lower_bound) | (df['평점'] > upper_bound)]

In [70]:
outliers

Empty DataFrame
Columns: [학번, 이름, 성별, 나이, 학과, 학년, 평점, 장학금, 입학일, 나이_25초과]
Index: []

In [72]:
df.dtypes

학번           int64
이름          object
성별          object
나이         float64
학과          object
학년           int64
평점         float64
장학금           bool
입학일         object
나이_25초과       bool
dtype: object

In [73]:
df['입학일_날짜'] = pd.to_datetime(df['입학일'])

In [74]:
df

     학번   이름 성별    나이     학과  학년   평점    장학금         입학일  나이_25초과     입학일_날짜
0  1001  김철수  남  21.0  컴퓨터공학   1  3.5  False  2021-03-02    False 2021-03-02
1  1002  이영희  여  23.0    경영학   3  4.2   True  2019-03-04    False 2019-03-04
2  1003  박민수  남  22.0    물리학   2  3.1  False  2020-03-02    False 2020-03-02
3  1004  정지영  여  24.0     화학   4  4.5   True  2018-03-05    False 2018-03-05
4  1005  최현우  남  20.0     수학   1  3.8  False  2021-03-02    False 2021-03-02
5  1006  강수진  여  23.0    영문학   3  4.0   True  2019-03-04    False 2019-03-04
6  1007  윤준호  남  22.0  컴퓨터공학   2  3.2  False  2020-03-02    False 2020-03-02
7  1008  송미라  여  21.0    통계학   1  3.9   True  2021-03-02    False 2021-03-02
8  1009  황태영  남  24.0    경영학   4  4.1  False  2018-03-05    False 2018-03-05
9  1010  조은지  여   NaN     화학   3  3.7   True  2019-03-04    False 2019-03-04

In [75]:
df.dtypes

학번                  int64
이름                 object
성별                 object
나이                float64
학과                 object
학년                  int64
평점                float64
장학금                  bool
입학일                object
나이_25초과              bool
입학일_날짜     datetime64[ns]
dtype: object

In [76]:
df['성별_범주'] = df['성별'].astype('category')

In [77]:
df

,학번,이름,성별,나이,학과,학년,평점,장학금,입학일,나이_25초과,입학일_날짜,성별_범주
0,1001,김철수,남,21.0,컴퓨터공학,1,3.5,False,2021-03-02,False,2021-03-02,남
1,1002,이영희,여,23.0,경영학,3,4.2,True,2019-03-04,False,2019-03-04,여
2,1003,박민수,남,22.0,물리학,2,3.1,False,2020-03-02,False,2020-03-02,남
3,1004,정지영,여,24.0,화학,4,4.5,True,2018-03-05,False,2018-03-05,여
4,1005,최현우,남,20.0,수학,1,3.8,False,2021-03-02,False,2021-03-02,남
5,1006,강수진,여,23.0,영문학,3,4.0,True,2019-03-04,False,2019-03-04,여
6,1007,윤준호,남,22.0,컴퓨터공학,2,3.2,False,2020-03-02,False,2020-03-02,남
7,1008,송미라,여,21.0,통계학,1,3.9,True,2021-03-02,False,2021-03-02,여
8,1009,황태영,남,24.0,경영학,4,4.1,False,2018-03-05,False,2018-03-05,남
9,1010,조은지,여,NaN,화학,3,3.7,True,2019-03-04,False,2019-03-04,여

In [78]:
df.dtypes

학번                  int64
이름                 object
성별                 object
나이                float64
학과                 object
학년                  int64
평점                float64
장학금                  bool
입학일                object
나이_25초과              bool
입학일_날짜     datetime64[ns]
성별_범주            category
dtype: object

In [79]:
df['학과_범주'] = df['학과'].astype('category')

In [80]:
df.dtypes

학번                  int64
이름                 object
성별                 object
나이                float64
학과                 object
학년                  int64
평점                float64
장학금                  bool
입학일                object
나이_25초과              bool
입학일_날짜     datetime64[ns]
성별_범주            category
학과_범주            category
dtype: object

In [81]:
gender_dummies = pd.get_dummies(df['성별'], prefix='성별')

In [82]:
gender_dummies

    성별_남   성별_여
0   True  False
1  False   True
2   True  False
3  False   True
4   True  False
5  False   True
6   True  False
7  False   True
8   True  False
9  False   True